Dragos-Hategan/esp32-file-system/third_party/esp_bsp_generic/src/esp_bsp_generic.c
/*
 * SPDX-FileCopyrightText: 2023-2025 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include "driver/gpio.h"
#include "esp_err.h"
#include "esp_log.h"
#include "esp_check.h"
#include "esp_spiffs.h"
#include "esp_vfs_fat.h"

#include "bsp/esp_bsp_generic.h"
#include "bsp_err_check.h"
#include "button_gpio.h"
#include "button_adc.h"
#include "led_indicator_strips.h"
#include "led_indicator_gpio.h"
#include "led_indicator_ledc.h"
#include "led_indicator_rgb.h"

#if CONFIG_BSP_DISPLAY_ENABLED
#include "driver/spi_master.h"
#include "esp_lcd_panel_io.h"
#include "esp_lcd_panel_vendor.h"
#include "esp_lcd_panel_ops.h"
#include "bsp/display.h"

#if CONFIG_BSP_DISPLAY_DRIVER_ILI9341
#include "esp_lcd_ili9341.h"
#elif CONFIG_BSP_DISPLAY_DRIVER_GC9A01
#include "esp_lcd_gc9a01.h"
#endif

#endif

#if CONFIG_BSP_TOUCH_ENABLED
#include "bsp/touch.h"
#if CONFIG_BSP_TOUCH_DRIVER_TT21100
#include "esp_lcd_touch_tt21100.h"
#elif CONFIG_BSP_TOUCH_DRIVER_GT1151
#include "esp_lcd_touch_gt1151.h"
#elif CONFIG_BSP_TOUCH_DRIVER_GT911
#include "esp_lcd_touch_gt911.h"
#elif CONFIG_BSP_TOUCH_DRIVER_CST816S
#include "esp_lcd_touch_cst816s.h"
#elif CONFIG_BSP_TOUCH_DRIVER_FT5X06
#include "esp_lcd_touch_ft5x06.h"
#endif
#endif

static const char *TAG = "BSP-Gen";

#if CONFIG_BSP_DISPLAY_ENABLED
static lv_display_t *disp;
static lv_indev_t *disp_indev = NULL;
#endif

#if CONFIG_BSP_TOUCH_ENABLED
static esp_lcd_touch_handle_t tp;   // LCD touch handle
#endif

/**
 * @brief I2C handle for BSP usage
 *
 * In IDF v5.4 you can call i2c_master_get_bus_handle(BSP_I2C_NUM, i2c_master_bus_handle_t *ret_handle)
 * from #include "esp_private/i2c_platform.h" to get this handle
 *
 * For IDF 5.2 and 5.3 you must call bsp_i2c_get_handle()
 */
static i2c_master_bus_handle_t i2c_handle = NULL;
static bool i2c_initialized = false;
sdmmc_card_t *bsp_sdcard = NULL;    // Global uSD card handler
extern blink_step_t const *bsp_led_blink_defaults_lists[];

typedef enum {
    BSP_BUTTON_TYPE_GPIO,
    BSP_BUTTON_TYPE_ADC
} bsp_button_type_t;

typedef struct {
    bsp_button_type_t type;
    union {
        button_gpio_config_t gpio;
        button_adc_config_t  adc;
    } cfg;
} bsp_button_config_t;

static const bsp_button_config_t bsp_button_config[] = {
#if CONFIG_BSP_BUTTONS_NUM > 0
#if CONFIG_BSP_BUTTON_1_TYPE_GPIO
    {
        .type = BSP_BUTTON_TYPE_GPIO,
        .cfg.gpio = {
            .gpio_num = BSP_BUTTON_1_IO,
            .active_level = CONFIG_BSP_BUTTON_1_LEVEL,
        }
    },
#elif CONFIG_BSP_BUTTON_1_TYPE_ADC
    {
        .type = BSP_BUTTON_TYPE_ADC,
        .cfg.adc = {
            .adc_channel = CONFIG_BSP_BUTTON_1_ADC_CHANNEL,
            .button_index = BSP_BUTTON_1,
            .min = (CONFIG_BSP_BUTTON_1_ADC_VALUE - 100),
            .max = (CONFIG_BSP_BUTTON_1_ADC_VALUE + 100)
        }
    },
#endif // CONFIG_BSP_BUTTON_1_TYPE_x
#endif // CONFIG_BSP_BUTTONS_NUM >= 0

#if CONFIG_BSP_BUTTONS_NUM > 1
#if CONFIG_BSP_BUTTON_2_TYPE_GPIO
    {
        .type = BSP_BUTTON_TYPE_GPIO,
        .cfg.gpio = {
            .gpio_num = BSP_BUTTON_2_IO,
            .active_level = CONFIG_BSP_BUTTON_2_LEVEL,
        }
    },
#elif CONFIG_BSP_BUTTON_2_TYPE_ADC
    {
        .type = BSP_BUTTON_TYPE_ADC,
        .cfg.adc = {
            .adc_channel = CONFIG_BSP_BUTTON_2_ADC_CHANNEL,
            .button_index = BSP_BUTTON_2,
            .min = (CONFIG_BSP_BUTTON_2_ADC_VALUE - 100),
            .max = (CONFIG_BSP_BUTTON_2_ADC_VALUE + 100)
        }
    },
#endif // CONFIG_BSP_BUTTON_2_TYPE_x
#endif // CONFIG_BSP_BUTTONS_NUM >= 1

#if CONFIG_BSP_BUTTONS_NUM > 2
#if CONFIG_BSP_BUTTON_3_TYPE_GPIO
    {
        .type = BSP_BUTTON_TYPE_GPIO,
        .cfg.gpio = {
            .gpio_num = BSP_BUTTON_3_IO,
            .active_level = CONFIG_BSP_BUTTON_3_LEVEL,
        }
    },
#elif CONFIG_BSP_BUTTON_3_TYPE_ADC
    {
        .type = BSP_BUTTON_TYPE_ADC,
        .cfg.adc = {
            .adc_channel = CONFIG_BSP_BUTTON_3_ADC_CHANNEL,
            .button_index = BSP_BUTTON_3,
            .min = (CONFIG_BSP_BUTTON_3_ADC_VALUE - 100),
            .max = (CONFIG_BSP_BUTTON_3_ADC_VALUE + 100)
        }
    },
#endif // CONFIG_BSP_BUTTON_3_TYPE_x
#endif // CONFIG_BSP_BUTTONS_NUM >= 2

#if CONFIG_BSP_BUTTONS_NUM > 3
#if CONFIG_BSP_BUTTON_4_TYPE_GPIO
    {
        .type = BSP_BUTTON_TYPE_GPIO,
        .cfg.gpio = {
            .gpio_num = BSP_BUTTON_4_IO,
            .active_level = CONFIG_BSP_BUTTON_4_LEVEL,
        }
    },
#elif CONFIG_BSP_BUTTON_4_TYPE_ADC
    {
        .type = BSP_BUTTON_TYPE_ADC,
        .cfg.adc = {
            .adc_channel = CONFIG_BSP_BUTTON_4_ADC_CHANNEL,
            .button_index = BSP_BUTTON_4,
            .min = (CONFIG_BSP_BUTTON_4_ADC_VALUE - 100),
            .max = (CONFIG_BSP_BUTTON_4_ADC_VALUE + 100)
        }
    },
#endif // CONFIG_BSP_BUTTON_4_TYPE_x
#endif // CONFIG_BSP_BUTTONS_NUM >= 3

#if CONFIG_BSP_BUTTONS_NUM > 4
#if CONFIG_BSP_BUTTON_5_TYPE_GPIO
    {
        .type = BSP_BUTTON_TYPE_GPIO,
        .cfg.gpio = {
            .gpio_num = BSP_BUTTON_5_IO,
            .active_level = CONFIG_BSP_BUTTON_5_LEVEL,
        }
    },
#elif CONFIG_BSP_BUTTON_5_TYPE_ADC
    {
        .type = BSP_BUTTON_TYPE_ADC,
        .cfg.adc = {
            .adc_channel = CONFIG_BSP_BUTTON_5_ADC_CHANNEL,
            .button_index = BSP_BUTTON_5,
            .min = (CONFIG_BSP_BUTTON_5_ADC_VALUE - 100),
            .max = (CONFIG_BSP_BUTTON_5_ADC_VALUE + 100)
        }
    }
#endif // CONFIG_BSP_BUTTON_5_TYPE_x
#endif // CONFIG_BSP_BUTTONS_NUM >= 4
};

#if CONFIG_BSP_LED_TYPE_GPIO
static led_indicator_gpio_config_t bsp_leds_gpio_config[] = {
    {
#if CONFIG_BSP_LED_1_LEVEL && CONFIG_BSP_LED_1_GPIO
        .is_active_level_high = CONFIG_BSP_LED_1_LEVEL,
        .gpio_num = CONFIG_BSP_LED_1_GPIO,
#endif
    },
    {
#if CONFIG_BSP_LED_2_LEVEL && CONFIG_BSP_LED_2_GPIO
        .is_active_level_high = CONFIG_BSP_LED_2_LEVEL,
        .gpio_num = CONFIG_BSP_LED_2_GPIO,
#endif
    },
    {
#if CONFIG_BSP_LED_3_LEVEL && CONFIG_BSP_LED_3_GPIO
        .is_active_level_high = CONFIG_BSP_LED_3_LEVEL,
        .gpio_num = CONFIG_BSP_LED_3_GPIO,
#endif
    },
    {
#if CONFIG_BSP_LED_4_LEVEL && CONFIG_BSP_LED_4_GPIO
        .is_active_level_high = CONFIG_BSP_LED_4_LEVEL,
        .gpio_num = CONFIG_BSP_LED_4_GPIO,
#endif
    },
    {
#if CONFIG_BSP_LED_5_LEVEL && CONFIG_BSP_LED_5_GPIO
        .is_active_level_high = CONFIG_BSP_LED_5_LEVEL,
        .gpio_num = CONFIG_BSP_LED_5_GPIO,
#endif
    }
};
